forks/wsdm-monitoring/esb-monitoring/data-collector/src/test/resources/test/addNewReportList/addNewReportListRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:raw="http://www.semeuse.org/data/rawReport">
	<soapenv:Header />
	<soapenv:Body>
		<raw:reportList xmlns:raw="http://www.semeuse.org/data/rawReport">
			<raw:report>
				<raw:exchangeId>1000</raw:exchangeId>
				<raw:dateInGMT>1000</raw:dateInGMT>
				<raw:consumerName>myConsumerEndpoint</raw:consumerName>
				<raw:serviceName>{http://www.webserviceX.NET/}StockQuote</raw:serviceName>
				<raw:operationName>myOperation</raw:operationName>
				<raw:interfaceName>myInterface</raw:interfaceName>
				<raw:serviceProviderName>{http://www.webserviceX.NET/}StockQuote</raw:serviceProviderName>
				<raw:endPoint>StockQuoteWSDMSoap1</raw:endPoint>
				<raw:contentLength>1000</raw:contentLength>
				<raw:doesThisResponseInIsAnException>false</raw:doesThisResponseInIsAnException>
			</raw:report>
			<raw:report>
				<raw:exchangeId>1000</raw:exchangeId>
				<raw:dateInGMT>2000</raw:dateInGMT>
				<raw:consumerName>myConsumerEndpoint</raw:consumerName>
				<raw:serviceName>{http://www.webserviceX.NET/}StockQuote</raw:serviceName>
				<raw:operationName>myOperation</raw:operationName>
				<raw:interfaceName>myInterface</raw:interfaceName>
				<raw:serviceProviderName>{http://www.webserviceX.NET/}StockQuote</raw:serviceProviderName>
				<raw:endPoint>StockQuoteWSDMSoap1</raw:endPoint>
				<raw:contentLength>2000</raw:contentLength>
				<raw:doesThisResponseInIsAnException>false</raw:doesThisResponseInIsAnException>
			</raw:report>
			<raw:report>
				<raw:exchangeId>1000</raw:exchangeId>
				<raw:dateInGMT>3000</raw:dateInGMT>
				<raw:consumerName>myConsumerEndpoint</raw:consumerName>
				<raw:serviceName>{http://www.webserviceX.NET/}StockQuote</raw:serviceName>
				<raw:operationName>myOperation</raw:operationName>
				<raw:interfaceName>myInterface</raw:interfaceName>
				<raw:serviceProviderName>{http://www.webserviceX.NET/}StockQuote</raw:serviceProviderName>
				<raw:endPoint>StockQuoteWSDMSoap1</raw:endPoint>
				<raw:contentLength>3000</raw:contentLength>
				<raw:doesThisResponseInIsAnException>false</raw:doesThisResponseInIsAnException>
			</raw:report>
			<raw:report>
				<raw:exchangeId>1000</raw:exchangeId>
				<raw:dateInGMT>3000</raw:dateInGMT>
				<raw:consumerName>myConsumerEndpoint</raw:consumerName>
				<raw:serviceName>{http://www.webserviceX.NET/}StockQuote</raw:serviceName>
				<raw:operationName>myOperation</raw:operationName>
				<raw:interfaceName>myInterface</raw:interfaceName>
				<raw:serviceProviderName>{http://www.webserviceX.NET/}StockQuote</raw:serviceProviderName>
				<raw:endPoint>StockQuoteWSDMSoap1</raw:endPoint>
				<raw:contentLength>3000</raw:contentLength>
				<raw:doesThisResponseInIsAnException>false</raw:doesThisResponseInIsAnException>
			</raw:report>
		</raw:reportList>
	</soapenv:Body>
</soapenv:Envelope>